Wojtuz/Hamownia-2026/STM32/base/Core/Src/main.c
          VESC_convertRawToStatus5(&status5, &rawFrame);
          testMotorStatus.voltage = status5.voltsIn * 100.0f;
          break;
        }
        default:
        {
          break;
        }
      }
    }
    
  }
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartBlinkTask */
/**
  * @brief  Function implementing the blinkTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartBlinkTask */
void StartBlinkTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
    HAL_GPIO_TogglePin(LED_OK_GPIO_Port, LED_OK_Pin);
    osDelay(100);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartRegulatorTask */
/**
* @brief Function implementing the regulatorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartRegulatorTask */
void StartRegulatorTask(void *argument)
{
  /* USER CODE BEGIN StartRegulatorTask */
  /* Infinite loop */
  for(;;)
  {
    if (regulatorON)
    {
      regulateTorquePI(torqueSetpoint, torqueValue, &brakeMotorVescData);
      if (brakeMotorVescData < 0)
      {
        brakeMotorVescCommand = VESC_COMMAND_SET_CURRENT_BRAKE;
      }
      else 
      {
        brakeMotorVescCommand = VESC_COMMAND_SET_CURRENT;
        brakeMotorVescData = -brakeMotorVescData;
      }

      CAN_TransmitVescCommand(&hfdcan1, brakeVescID, brakeMotorVescCommand, brakeMotorVescData);
    }
    else 
    {
      resetRegulatorState();
    }
    osDelay(100);
  }
  /* USER CODE END StartRegulatorTask */
}

/* USER CODE BEGIN Header_StartUartTxTask */
/**
* @brief Function implementing the uartTxTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartUartTxTask */
void StartUartTxTask(void *argument)
{
  /* USER CODE BEGIN StartUartTxTask */
  /* Infinite loop */
  for(;;)
  {
    struct Message msg;

    UART_CreateMessage16(&msg, FEEDBACK_BRAKE_MOTOR_SPEED, brakeMotorStatus.speed);
    UART_TransmitMessageDMA(&huart1, &msg);
    UART_CreateMessage16(&msg, FEEDBACK_BRAKE_MOTOR_CURRENT, brakeMotorStatus.current);
    UART_TransmitMessageDMA(&huart1, &msg);
    UART_CreateMessage16(&msg, FEEDBACK_BRAKE_MOTOR_VOLTAGE, brakeMotorStatus.voltage);
    UART_TransmitMessageDMA(&huart1, &msg);

    UART_CreateMessage16(&msg, FEEDBACK_TEST_MOTOR_SPEED, testMotorStatus.speed);
    UART_TransmitMessageDMA(&huart1, &msg);
    UART_CreateMessage16(&msg, FEEDBACK_TEST_MOTOR_CURRENT, testMotorStatus.current);
    UART_TransmitMessageDMA(&huart1, &msg);
    UART_CreateMessage16(&msg, FEEDBACK_TEST_MOTOR_VOLTAGE, testMotorStatus.voltage);
    UART_TransmitMessageDMA(&huart1, &msg);
    
    if (newVescID != 0x00)
    {
      UART_CreateMessage8(&msg, NEW_CAN_ID, newVescID);
      UART_TransmitMessageDMA(&huart1, &msg);
    }
    
    osDelay(50);
  }
  /* USER CODE END StartUartTxTask */
}

/* USER CODE BEGIN Header_StartUartRxTask */
/**
* @brief Function implementing the uartRxTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartUartRxTask */
void StartUartRxTask(void *argument)
{
  /* USER CODE BEGIN StartUartRxTask */
  /// Commands from ESP
  UART_StartReceiveDMA(&huart1, &hdma_usart1_rx);
  HAL_Delay(1000);
  
  /* Infinite loop */
  for(;;)
  {
    UART_ProcessRxDmaBuffer(&huart1, &hfdcan1, &hdma_usart1_rx);
    osDelay(10);
  }
  /* USER CODE END StartUartRxTask */
}

/* USER CODE BEGIN Header_StartCanTxBrakeTask */
/**
* @brief Function implementing the canTxBrakeTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCanTxBrakeTask */
void StartCanTxBrakeTask(void *argument)
{
  /* USER CODE BEGIN StartCanTxBrakeTask */
  while(!uart_started)
  {
    osDelay(1);
  }
  
  /* Infinite loop */
  for(;;)
  {
    if (!regulatorON)
    {
      CAN_TransmitVescCommand(&hfdcan1, brakeVescID, brakeMotorVescCommand, brakeMotorVescData);
    }
    osDelay(100);
  }
  /* USER CODE END StartCanTxBrakeTask */
}

/* USER CODE BEGIN Header_StartCanTxTestTask */
/**
* @brief Function implementing the canTxTestTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCanTxTestTask */
void StartCanTxTestTask(void *argument)
{
  /* USER CODE BEGIN StartCanTxTestTask */
  while(!uart_started)
  {
    osDelay(1);
  }
  
  /* Infinite loop */
  for(;;)
  {
    //Tested motor has to work no matter what brake motor is doing
    CAN_TransmitVescCommand(&hfdcan1, testVescID, testMotorVescCommand, testMotorVescData);
    osDelay(100);
  }
  /* USER CODE END StartCanTxTestTask */
}

/* USER CODE BEGIN Header_StartInaTask */
/**
* @brief Function implementing the inaTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartInaTask */
void StartInaTask(void *argument)
{
  /* USER CODE BEGIN StartInaTask */
  osDelay(500); 
  while(1==1)
  {
    osDelay(100);
  }
  volatile uint8_t found_address = 0;
  HAL_StatusTypeDef result;
  
  // Przeszukujemy adresy 7-bitowe od 1 do 127
  for (uint8_t i = 1; i < 128; i++)
  {
      // HAL wymaga adresu przesuniętego w lewo (8-bitowego)
      // Używamy funkcji HAL_I2C_IsDeviceReady, która wysyła tylko adres i czeka na ACK
      result = HAL_I2C_IsDeviceReady(&hi2c1, (i << 1), 3, 5);
      
      if (result == HAL_OK)
      {
          found_address = i;
          if (found_address == 120)
          {
            HAL_GPIO_TogglePin(LED_OK_GPIO_Port, LED_ER_Pin);
          }
          // Tutaj możesz postawić Breakpoint w debuggerze!
          // Jeśli program tu wejdzie, 'found_address' pokaże Twój czysty, 7-bitowy adres.
          
          // Opcjonalnie: jeśli masz podpiętych kilka układów, nie przerywaj pętli (usuń break)
          break; 
      }
  }

  osDelay(1000);
  INA237_InitDevice(0x44);
  /* Infinite loop */
  for(;;)
  {
    uint16_t temp = INA237_ReadRegister(0x44, 0x3e);
    osDelay(100);
  }
  /* USER CODE END StartInaTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle, &hi2c1
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
